{
  "nav": {
    "home": "หน้าหลัก",
    "about": "เกี่ยวกับเรา",
    "portfolio": "ผลงาน",
    "services": "บริการ",
    "contact": "ติดต่อ"
  },
  "navServices": {
    "fullHome": "งานก่อสร้างและออกแบบตกแต่งภายในบ้านครบวงจร",
    "kitchen": "ปรับปรุงห้องครัว",
    "bathroom": "ออกแบบห้องน้ำใหม่",
    "singleRoom": "ปรับปรุงห้องใดห้องหนึ่ง",
    "customFurniture": "เฟอร์นิเจอร์สั่งทำพิเศษ"
  },
  "home": {
    "tagline": "รีเจน เลนซ — งานก่อสร้างภายใน และเฟอร์นิเจอร์สั่งทำพิเศษ",
    "heroTitle": "การก่อสร้างภายใน • การปรับปรุง • เฟอร์นิเจอร์สั่งทำพิเศษ",
    "heroDescription": "ที่ รีเจน เลนซ เราเปลี่ยนแปลงพื้นที่ด้วยความแม่นยำ ความคิดสร้างสรรค์ และฝีมือที่ประณีต ไม่ว่าคุณจะปรับปรุงบ้านทั้งหลังหรือเพียงแค่ห้องเดียว ทีมงานของเราพร้อมมอบพื้นที่ภายในที่สวยงามและใช้งานได้จริงที่สร้างขึ้นเพื่อความคงทนยาวนาน ตั้งแต่การก่อสร้างขนาดใหญ่ไปจนถึงเฟอร์นิเจอร์สั่งทำพิเศษ เราสร้างสรรค์ความคิดของคุณให้เป็นจริงด้วยคุณภาพที่ยอดเยี่ยม — และในราคาที่คุ้มค่าเกินคาด",
    "viewPortfolio": "ดูผลงาน",
    "startProject": "เริ่มโปรเจกต์",
    "whatWeDo": "สิ่งที่เราทำ",
    "redefiningLanes": "นิยามใหม่ของการใช้ชีวิต",
    "whatWeDoDescription": "ที่บริษัท รีเจน เลนซ โฮลดิ้ง จำกัด เราให้บริการงานก่อสร้างภายในแบบครบวงจร — ตั้งแต่การปรับปรุงโครงสร้างไปจนถึงรายละเอียดการตกแต่ง ไม่ว่าคุณจะเปลี่ยนแปลงบ้านทั้งหลัง ปรับปรุงห้องครัว ออกแบบห้องน้ำใหม่ หรือเพียงแค่ปรับปรุงห้องใดห้องหนึ่ง ทีมงานของเราพร้อมมอบผลลัพธ์ที่สมบูรณ์แบบในทุกครั้ง",
    "services": "บริการ",
    "whatWeDoTitle": "สิ่งที่เราทำ",
    "servicesDescription1": "ที่บริษัท รีเจน เลนซ โฮลดิ้ง จำกัด เราให้บริการงานก่อสร้างภายในแบบครบวงจร — ตั้งแต่การปรับปรุงโครงสร้างไปจนถึงรายละเอียดการตกแต่ง ไม่ว่าคุณจะเปลี่ยนแปลงบ้านทั้งหลัง ปรับปรุงห้องครัว ออกแบบห้องน้ำใหม่ หรือเพียงแค่ปรับปรุงห้องใดห้องหนึ่ง ทีมงานของเราพร้อมมอบผลลัพธ์ที่สมบูรณ์แบบในทุกครั้ง",
    "servicesDescription2": "นอกจากนี้ เรายังสร้างเฟอร์นิเจอร์สั่งทำพิเศษที่ออกแบบตามสไตล์และขนาดที่คุณต้องการ เพียงแค่แสดงภาพตัวอย่างให้เรา เราจะสร้างสรรค์ผลงานที่เหมือนต้นแบบในราคาที่คุ้มค่า โดยไม่ลดทอนคุณภาพ",
    "whyChoose": "ทำไมต้องเลือก รีเจน เลนซ",
    "qualityWorkmanship": "งานคุณภาพ",
    "qualityWorkmanshipDesc": "ความเป็นเลิศในทุกรายละเอียด",
    "transparentPricing": "ราคาที่โปร่งใส",
    "transparentPricingDesc": "ไม่มีค่าใช้จ่ายแอบแฝง มอบความคุ้มค่าอย่างซื่อสัตย์",
    "fastReliable": "รวดเร็วและเชื่อถือได้",
    "fastReliableDesc": "ตรงเวลาในทุกครั้ง",
    "tailoredToYou": "ปรับแต่งตามความต้องการของคุณ",
    "tailoredToYouDesc": "ออกแบบให้เหมาะสมกับไลฟ์สไตล์ของคุณ",
    "oneStopPartner": "พันธมิตรการปรับปรุงครบวงจร",
    "oneStopPartnerDesc": "ตั้งแต่แนวคิดจนถึงการเสร็จสมบูรณ์",
    "selectedWorks": "ผลงานที่ได้คัดเลือก",
    "spatialCaseStudies": "กรณีศึกษาการออกแบบพื้นที่",
    "seeAll": "ดูทั้งหมด →",
    "ourExpertise": "ความเชี่ยวชาญของเรา",
    "residential": "งานที่พักอาศัย",
    "residentialDesc": "งานออกแบบตกแต่งภายในแบบครบวงจร สำหรับบ้านและคอนโดสมัยใหม่",
    "commercial": "งานเชิงพาณิชย์",
    "commercialDesc": "งานออกแบบสำนักงานและพื้นที่ค้าปลีก ที่ถ่ายทอดอัตลักษณ์ของแบรนด์ผ่านการออกแบบพื้นที่",
    "consultation": "บริการให้คำปรึกษา",
    "consultationDesc": "ด้านการวางผังพื้นที่ งานภาพ 3D และคำแนะนำในการคัดสรรวัสดุอย่างพิถีพิถัน",
    "startYourProject": "เริ่มโปรเจกต์ของคุณ",
    "tellUsAboutSpace": "บอกเล่าเกี่ยวกับพื้นที่ของคุณ",
    "shareAmbitions": "แบ่งปันความต้องการของคุณ แล้วเราจะตอบกลับด้วยขอบเขตงาน ไทม์ไลน์ และราคาที่เหมาะสม",
    "name": "ชื่อ",
    "yourName": "ชื่อของคุณ",
    "email": "อีเมล",
    "message": "ข้อความ",
    "tellUsNeeds": "บอกเราเกี่ยวกับความต้องการของคุณ...",
    "sendInquiry": "ส่งข้อความ"
  },
  "about": {
    "whoWeAre": "เราเป็นใคร",
    "title": "เกี่ยวกับ รีเจน เลนซ",
    "description": "บริษัท รีเจน เลนซ โฮลดิ้ง จำกัด คือบริษัทรับเหมาก่อสร้างและตกแต่งภายใน รวมถึงเฟอร์นิเจอร์สั่งทำพิเศษในกรุงเทพมหานคร มุ่งมั่นในการเปลี่ยนพื้นที่ที่อยู่อาศัยและเชิงพาณิชย์ให้โดดเด่นด้วยความแม่นยำ ความคงทน และความงามในสไตล์มินิมอลที่สงบเรียบง่าย",
    "ourMission": "เป้าหมายของเรา",
    "missionText": "สร้างสรรค์งานตกแต่งภายในที่สวยงาม ใช้งานได้จริง และให้ความรู้สึกเรียบง่าย เป็นธรรมชาติ เหมาะกับการอยู่อาศัยและการทำงานในทุกวัน",
    "ourVision": "วิสัยทัศน์ของเรา",
    "visionText": "เป็นพันธมิตรด้านงานก่อสร้างและตกแต่งภายในที่ได้รับความไว้วางใจมากที่สุดในประเทศไทย สำหรับลูกค้าที่ใส่ใจในคุณภาพและรายละเอียดทุกขั้นตอน",
    "ourPhilosophy": "ปรัชญาของเรา",
    "craftsmanshipTitle": "งานฝีมือในทุกรายละเอียด",
    "philosophyDescription": "เราออกแบบและคัดสรรบรรยากาศของพื้นที่ โดยผสานงานช่างแบบดั้งเดิมเข้ากับเส้นสายที่เรียบง่ายร่วมสมัย วัสดุทุกชิ้น รอยต่อทุกจุด และผิวสัมผัสทุกขั้นตอน ล้วนผ่านการพิจารณาอย่างรอบคอบ เพื่อให้พื้นที่สุดท้ายให้ความรู้สึกสงบ มีความหมาย และคงทนยาวนาน",
    "sustainableMaterial": "การเลือกใช้วัสดุที่ยั่งยืน",
    "clientCentric": "การทำงานร่วมกับลูกค้าเป็นศูนย์กลาง",
    "precisionEngineering": "วิศวกรรมที่แม่นยำและการควบคุมคุณภาพอย่างเข้มงวด",
    "values": {
      "craftsmanshipFirst": "ฝีมือมาก่อน",
      "craftsmanshipFirstDesc": "สร้างโดยผู้เชี่ยวชาญที่ใส่ใจในข้อต่อ การตกแต่ง และความแข็งแรงของโครงสร้าง",
      "precisionPlanning": "วางแผนอย่างแม่นยำ",
      "precisionPlanningDesc": "แบบที่วัดมา ขอบเขตที่ชัดเจน และไทม์ไลน์ที่เป็นจริงช่วยให้โปรเจกต์ดำเนินไปตามแผน",
      "endToEnd": "ส่งมอบครบวงจร",
      "endToEndDesc": "งานก่อสร้าง งานไม้ และการติดตั้งดำเนินการโดยทีมเดียวที่รับผิดชอบ",
      "minimalWarm": "มินิมอล อบอุ่น น่าอยู่",
      "minimalWarmDesc": "เส้นสายสะอาด วัสดุจริง และแสงที่ทำให้พื้นที่รู้สึกสงบและมีจุดมุ่งหมาย"
    },
    "readyToTransform": "พร้อมที่จะแปลงโฉมพื้นที่ของคุณ?",
    "letDiscuss": "มาพูดคุยกันว่าเราจะทำให้วิสัยทัศน์ของคุณเป็นจริงได้อย่างไรด้วยความเชี่ยวชาญของเรา",
    "startAProject": "เริ่มโปรเจกต์"
  },
  "contact": {
    "getInTouch": "ติดต่อเรา",
    "title": "ติดต่อเรา",
    "description": "บอกเราถึงความต้องการในการออกแบบตกแต่งบ้านหรือเฟอร์นิเจอร์สั่งทำพิเศษของคุณ เราจะตอบกลับด้วยขอบเขตงาน ระยะเวลา และแนวทางการลงทุนที่เหมาะสมสำหรับคุณ",
    "contactInfo": "ข้อมูลติดต่อ",
    "companyName": "บริษัท รีเจน เลนซ โฮลดิ้ง จำกัด",
    "hours": "จันทร์ – เสาร์, 09:00 – 18:00",
    "visitUs": "เยี่ยมชมเรา",
    "call": "โทรศัพท์",
    "email": "อีเมล",
    "lineOfficial": "Line Official",
    "connectWithUs": "เชื่อมต่อกับเรา",
    "social": "โซเชียล",
    "startProject": "เริ่มโปรเจกต์",
    "sendUsMessage": "ส่งข้อความถึงเรา",
    "respondTime": "โดยปกติเราจะตอบกลับภายในหนึ่งวันทำการ",
    "name": "ชื่อ",
    "yourName": "ชื่อของคุณ",
    "emailLabel": "อีเมล",
    "emailPlaceholder": "your@email.com",
    "subject": "หัวข้อ",
    "subjectPlaceholder": "สอบถามงานอินทีเรีย",
    "message": "ข้อความ",
    "messagePlaceholder": "เราช่วยอะไรคุณได้บ้าง?",
    "sendMessage": "ส่งข้อความ"
  },
  "portfolio": {
    "selectedWorks": "ผลงานที่ได้คัดเลือก",
    "title": "กรณีศึกษาการออกแบบพื้นที่",
    "all": "ทั้งหมด",
    "residential": "งานที่พักอาศัย",
    "commercial": "งานเชิงพาณิชย์",
    "furniture": "เฟอร์นิเจอร์สั่งทำพิเศษ"
  },
  "services": {
    "ourServices": "บริการของเรา",
    "requestConsultation": "ขอคำปรึกษา",
    "fullRenovation": {
      "title": "งานก่อสร้างและออกแบบตกแต่งภายในบ้านครบวงจร",
      "subtitle": "การเปลี่ยนโฉมบ้านอย่างสมบูรณ์แบบ",
      "description": "รีเจน เลนซ มอบบริการออกแบบบ้านแบบครบวงจร ตั้งแต่การรื้อถอน ปรับโครงสร้าง งานระบบเครื่องกล ไฟฟ้า ประปา พื้น ไฟส่องสว่าง เฟอร์นิเจอร์บิลต์อิน ไปจนถึงการบริหารจัดการโครงการอย่างครบถ้วน เราดูแลทุกขั้นตอนและรายละเอียด เพื่อเปลี่ยนวิสัยทัศน์ของคุณให้กลายเป็นผลงานบ้านที่น่าอยู่และงดงามสมบูรณ์แบบ",
      "whyFullRenovation": "ทำไมต้องออกแบบตกแต่งครบวงจร?",
      "whyTitle": "สร้างสรรค์พื้นที่พักอาศัยของคุณใหม่ตั้งแต่รากฐาน",
      "whyDesc1": "การออกแบบบ้านแบบครบวงจรช่วยสร้างภาษาการออกแบบที่สอดคล้องกันทั่วทั้งบ้าน แก้ไขปัญหาโครงสร้างที่แฝงอยู่ และเป็นการปรับปรุงระบบเดิมที่เสื่อมสภาพ เพิ่มมูลค่าและความสะดวกสบายให้กับทรัพย์สินของคุณอย่างชัดเจน",
      "whyDesc2": "เรามองแต่ละโครงการเป็นการร่วมมือที่ใส่ใจ เคารพโครงสร้างทางสถาปัตยกรรมของอาคาร พร้อมเติมการใช้งานที่สมัยใหม่เหมาะกับรูปแบบการใช้ชีวิตที่สะท้อนตัวตนและรสนิยมอย่างลงตัวของคุณ",
      "demolitionStructure": "การรื้อถอนและปรับโครงสร้าง",
      "demolitionStructureDesc": "การรื้อถอนภายในเดิมอย่างปลอดภัย พร้อมปรับโครงสร้างอย่างแม่นยำ เพื่อเปิดพื้นที่ใหม่และนิยามรูปแบบการจัดวางใหม่อย่างลงตัว",
      "mepSystems": "ระบบเครื่องกล ไฟฟ้า และประปา",
      "mepSystemsDesc": "การปรับปรุงระบบเครื่องกล ไฟฟ้า และประปาอย่างครบถ้วน เพื่อความปลอดภัย ประสิทธิภาพ และมาตรฐานสมัยใหม่",
      "flooringFinishes": "พื้นผิวและงานตกแต่ง",
      "flooringFinishesDesc": "การติดตั้งพื้นคุณภาพสูง การตกแต่งผนัง และการทาสี ด้วยวัสดุชั้นดีทุกขั้นตอน เพื่อให้ได้งานสำเร็จที่เรียบเนียนและสมบูรณ์แบบ",
      "lightingDesign": "การออกแบบแสงสว่าง",
      "lightingDesignDesc": "การวางแผนและติดตั้งระบบแสงสว่างเชิงสถาปัตยกรรม เพื่อยกระดับบรรยากาศ การใช้งาน และความสวยงามของพื้นที่อย่างลงตัว",
      "builtInsFurniture": "เฟอร์นิเจอร์บิลต์อินและงานไม้สั่งทำ",
      "builtInsFurnitureDesc": "งานไม้และเฟอร์นิเจอร์สั่งทำพิเศษ ออกแบบอย่างประณีตเพื่อตอบโจทย์การใช้งานและการจัดเก็บของพื้นที่คุณ",
      "projectManagement": "การบริหารจัดการโครงการ",
      "projectManagementDesc": "การดูแลทุกขั้นตอน ตั้งแต่การกำกับงาน การควบคุมระยะเวลา ไปจนถึงการรับประกันคุณภาพ เพื่อให้การออกแบบตกแต่งของคุณเป็นไปอย่างราบรื่นและปราศจากความกังวล"
    }
  },
  "footer": {
    "copyright": "© 2024 Regen Lanes สงวนลิขสิทธิ์"
  },
  "common": {
    "language": "ภาษา",
    "english": "English",
    "thai": "ไทย"
  }
}
