{
  "nav": {
    "home": "หน้าหลัก",
    "about": "เกี่ยวกับเรา",
    "portfolio": "ผลงาน",
    "services": "บริการ",
    "contact": "ติดต่อ"
  },
  "navServices": {
    "fullHome": "ก่อสร้างและปรับปรุงภายในบ้านแบบครบวงจร",
    "kitchen": "ปรับปรุงห้องครัว",
    "bathroom": "ปรับปรุงห้องน้ำ",
    "singleRoom": "ปรับปรุงห้องเดี่ยว",
    "customFurniture": "เฟอร์นิเจอร์สั่งทำ"
  },
  "home": {
    "tagline": "Regen Lanes — งานก่อสร้างภายใน และเฟอร์นิเจอร์สั่งทำ",
    "heroTitle": "งานก่อสร้างภายใน • รีโนเวท • เฟอร์นิเจอร์สั่งทำ",
    "heroDescription": "ที่ Regen Lanes เราแปลงโฉมพื้นที่ด้วยความแม่นยำ ความคิดสร้างสรรค์ และฝีมือช่าง ไม่ว่าคุณจะกำลังรีโนเวทบ้านทั้งหลังหรืออัพเกรดห้องเดียว ทีมงานของเราส่งมอบอินทีเรียที่สวยงาม ใช้งานได้จริง และทนทาน ตั้งแต่งานก่อสร้างขนาดใหญ่ไปจนถึงเฟอร์นิเจอร์สั่งทำ เราทำให้ไอเดียของคุณเป็นจริงด้วยคุณภาพที่ยอดเยี่ยม — ในราคาที่คุ้มค่า",
    "viewPortfolio": "ดูผลงาน",
    "startProject": "เริ่มโปรเจกต์",
    "whatWeDo": "สิ่งที่เราทำ",
    "redefiningLanes": "นิยามใหม่ของการใช้ชีวิต",
    "whatWeDoDescription": "ที่ Regen Lanes Holding Company Limited เราให้บริการก่อสร้างภายในแบบครบวงจร — ตั้งแต่งานโครงสร้างไปจนถึงงานตกแต่ง ไม่ว่าคุณจะกำลังแปลงโฉมบ้านทั้งหลัง อัพเกรดห้องครัว ปรับปรุงห้องน้ำ หรือรีเฟรชห้องเดียว ทีมงานของเราส่งมอบผลงานที่สมบูรณ์แบบทุกครั้ง",
    "services": "บริการ",
    "whatWeDoTitle": "สิ่งที่เราทำ",
    "servicesDescription1": "ที่ Regen Lanes Holding Company Limited เราให้บริการก่อสร้างภายในแบบครบวงจร — ตั้งแต่งานโครงสร้างไปจนถึงงานตกแต่ง ไม่ว่าคุณจะกำลังแปลงโฉมบ้านทั้งหลัง อัพเกรดห้องครัว ปรับปรุงห้องน้ำ หรือรีเฟรชห้องเดียว ทีมงานของเราส่งมอบผลงานที่สมบูรณ์แบบทุกครั้ง",
    "servicesDescription2": "เรายังทำเฟอร์นิเจอร์สั่งทำ ผลิตด้วยมือตามสไตล์และขนาดของคุณ แสดงรูปให้เราดู แล้วเราจะสร้างใหม่ในราคาที่คุ้มค่าโดยไม่ลดทอนคุณภาพ",
    "whyChoose": "ทำไมต้องเลือก Regen Lanes",
    "qualityWorkmanship": "ฝีมือคุณภาพ",
    "qualityWorkmanshipDesc": "ความเป็นเลิศในทุกรายละเอียด",
    "transparentPricing": "ราคาโปร่งใส",
    "transparentPricingDesc": "ไม่มีค่าใช้จ่ายแอบแฝง เพียงความคุ้มค่าที่แท้จริง",
    "fastReliable": "รวดเร็วและเชื่อถือได้",
    "fastReliableDesc": "ตรงเวลาทุกครั้ง",
    "tailoredToYou": "ออกแบบเฉพาะคุณ",
    "tailoredToYouDesc": "ปรับแต่งให้เข้ากับไลฟ์สไตล์ของคุณ",
    "oneStopPartner": "พันธมิตรรีโนเวทครบวงจร",
    "oneStopPartnerDesc": "ตั้งแต่แนวคิดจนถึงส่งมอบ",
    "selectedWorks": "ผลงานที่เลือกสรร",
    "spatialCaseStudies": "กรณีศึกษาพื้นที่",
    "seeAll": "ดูทั้งหมด →",
    "ourExpertise": "ความเชี่ยวชาญของเรา",
    "residential": "ที่พักอาศัย",
    "residentialDesc": "รีโนเวทและจัดสไตล์ภายในสำหรับบ้านและคอนโดสมัยใหม่",
    "commercial": "พาณิชยกรรม",
    "commercialDesc": "ออกแบบออฟฟิศและร้านค้าที่สื่อสารแบรนด์ผ่านพื้นที่",
    "consultation": "ที่ปรึกษา",
    "consultationDesc": "วางแผนพื้นที่ 3D เรนเดอริง และคำแนะนำการเลือกวัสดุ",
    "startYourProject": "เริ่มโปรเจกต์ของคุณ",
    "tellUsAboutSpace": "บอกเล่าเกี่ยวกับพื้นที่ของคุณ",
    "shareAmbitions": "แบ่งปันความต้องการของคุณ แล้วเราจะตอบกลับด้วยขอบเขตงาน ไทม์ไลน์ และราคาที่เหมาะสม",
    "name": "ชื่อ",
    "yourName": "ชื่อของคุณ",
    "email": "อีเมล",
    "message": "ข้อความ",
    "tellUsNeeds": "บอกเราเกี่ยวกับความต้องการของคุณ...",
    "sendInquiry": "ส่งข้อความ"
  },
  "about": {
    "whoWeAre": "เราคือใคร",
    "title": "เกี่ยวกับ Regen Lanes",
    "description": "Regen Lanes Holding Company Limited เป็นพันธมิตรด้านงานก่อสร้างภายในและเฟอร์นิเจอร์สั่งทำในกรุงเทพ มุ่งมั่นในการแปลงโฉมพื้นที่ที่พักอาศัยและพาณิชย์ด้วยความแม่นยำ ความทนทาน และมินิมอลที่สงบเรียบร้อย",
    "ourMission": "พันธกิจของเรา",
    "missionText": "สร้างอินทีเรียที่สวยงาม ใช้งานได้จริง และรู้สึกสบายในการอยู่อาศัยและทำงาน",
    "ourVision": "วิสัยทัศน์ของเรา",
    "visionText": "เป็นพันธมิตรงานก่อสร้างภายในที่น่าเชื่อถือที่สุดในประเทศไทยสำหรับลูกค้าที่ใส่ใจรายละเอียด",
    "ourPhilosophy": "ปรัชญาของเรา",
    "craftsmanshipTitle": "ฝีมือในทุกรายละเอียด",
    "philosophyDescription": "เราสร้างบรรยากาศ—ผสมผสานงานฝีมือแบบดั้งเดิมกับเส้นสายมินิมอลสมัยใหม่ ทุกวัสดุ ข้อต่อ และการตกแต่งถูกพิจารณาอย่างละเอียดเพื่อให้พื้นที่รู้สึกสงบ มีจุดมุ่งหมาย และสร้างมาให้คงทน",
    "sustainableMaterial": "เลือกใช้วัสดุที่ยั่งยืน",
    "clientCentric": "ทำงานร่วมกับลูกค้าเป็นศูนย์กลาง",
    "precisionEngineering": "วิศวกรรมที่แม่นยำและควบคุมคุณภาพ",
    "values": {
      "craftsmanshipFirst": "ฝีมือมาก่อน",
      "craftsmanshipFirstDesc": "สร้างโดยผู้เชี่ยวชาญที่ใส่ใจในข้อต่อ การตกแต่ง และความแข็งแรงของโครงสร้าง",
      "precisionPlanning": "วางแผนอย่างแม่นยำ",
      "precisionPlanningDesc": "แบบที่วัดมา ขอบเขตที่ชัดเจน และไทม์ไลน์ที่เป็นจริงช่วยให้โปรเจกต์ดำเนินไปตามแผน",
      "endToEnd": "ส่งมอบครบวงจร",
      "endToEndDesc": "งานก่อสร้าง งานไม้ และการติดตั้งดำเนินการโดยทีมเดียวที่รับผิดชอบ",
      "minimalWarm": "มินิมอล อบอุ่น น่าอยู่",
      "minimalWarmDesc": "เส้นสายสะอาด วัสดุจริง และแสงที่ทำให้พื้นที่รู้สึกสงบและมีจุดมุ่งหมาย"
    },
    "readyToTransform": "พร้อมที่จะแปลงโฉมพื้นที่ของคุณ?",
    "letDiscuss": "มาพูดคุยกันว่าเราจะทำให้วิสัยทัศน์ของคุณเป็นจริงได้อย่างไรด้วยความเชี่ยวชาญของเรา",
    "startAProject": "เริ่มโปรเจกต์"
  },
  "contact": {
    "getInTouch": "ติดต่อเรา",
    "title": "ติดต่อเรา",
    "description": "บอกเล่าเกี่ยวกับงานรีโนเวทหรือเฟอร์นิเจอร์สั่งทำที่คุณต้องการ เราจะตอบกลับด้วยขอบเขตงาน ไทม์ไลน์ และราคาที่เหมาะสม",
    "contactInfo": "ข้อมูลติดต่อ",
    "companyName": "บริษัท รีเจน เลนส์ โฮลดิ้ง จำกัด",
    "hours": "จันทร์ - เสาร์, 9:00 - 18:00",
    "visitUs": "ที่อยู่",
    "call": "โทร",
    "email": "อีเมล",
    "lineOfficial": "Line Official",
    "connectWithUs": "เชื่อมต่อกับเรา",
    "social": "โซเชียล",
    "startProject": "เริ่มโปรเจกต์",
    "sendUsMessage": "ส่งข้อความถึงเรา",
    "respondTime": "โดยปกติเราจะตอบกลับภายในหนึ่งวันทำการ",
    "name": "ชื่อ",
    "yourName": "ชื่อของคุณ",
    "emailLabel": "อีเมล",
    "emailPlaceholder": "your@email.com",
    "subject": "หัวข้อ",
    "subjectPlaceholder": "สอบถามงานอินทีเรีย",
    "message": "ข้อความ",
    "messagePlaceholder": "เราช่วยอะไรคุณได้บ้าง?",
    "sendMessage": "ส่งข้อความ"
  },
  "portfolio": {
    "selectedWorks": "ผลงานที่เลือกสรร",
    "title": "ผลงานของเรา",
    "all": "ทั้งหมด",
    "residential": "ที่พักอาศัย",
    "commercial": "พาณิชยกรรม",
    "furniture": "เฟอร์นิเจอร์สั่งทำ"
  },
  "services": {
    "ourServices": "บริการของเรา",
    "requestConsultation": "ขอคำปรึกษา",
    "fullRenovation": {
      "title": "ก่อสร้างและปรับปรุงภายในบ้านแบบครบวงจร",
      "subtitle": "แปลงโฉมบ้านอย่างสมบูรณ์",
      "description": "Regen Lanes ให้บริการรีโนเวทบ้านอย่างครบวงจร รวมถึงการรื้อถอน ปรับโครงสร้าง งานระบบ MEP (เครื่องกล ไฟฟ้า ประปา) พื้น แสงสว่าง งานบิลท์อิน และการบริหารโครงการ เราดูแลทุกรายละเอียดเพื่อเปลี่ยนวิสัยทัศน์ของคุณให้เป็นผลงานที่น่าอยู่อาศัย",
      "whyFullRenovation": "ทำไมต้องรีโนเวททั้งหลัง?",
      "whyTitle": "สร้างที่พักผ่อนใหม่ตั้งแต่พื้นขึ้นมา",
      "whyDesc1": "การรีโนเวทบ้านทั้งหลังช่วยให้การออกแบบมีความสอดคล้องกันทั่วทั้งอสังหาริมทรัพย์ แก้ไขปัญหาโครงสร้างที่ซ่อนอยู่และอัพเกรดระบบที่เก่า เพิ่มมูลค่าและความสะดวกสบายให้กับทรัพย์สินของคุณ",
      "whyDesc2": "เราดำเนินโครงการแต่ละโครงการในรูปแบบความร่วมมือ เคารพความสมบูรณ์ของสถาปัตยกรรมอาคารในขณะที่เพิ่มฟังก์ชันการใช้งานสมัยใหม่ที่ปรับให้เข้ากับไลฟ์สไตล์ของคุณ",
      "demolitionStructure": "รื้อถอนและโครงสร้าง",
      "demolitionStructureDesc": "รื้อถอนอินทีเรียเดิมอย่างปลอดภัยและปรับโครงสร้างอย่างแม่นยำเพื่อเปิดพื้นที่และกำหนดเลย์เอาท์ใหม่",
      "mepSystems": "ระบบ MEP",
      "mepSystemsDesc": "ปรับปรุงระบบเครื่องกล ไฟฟ้า และประปาอย่างสมบูรณ์เพื่อความปลอดภัย ประสิทธิภาพ และมาตรฐานสมัยใหม่",
      "flooringFinishes": "พื้นและการตกแต่ง",
      "flooringFinishesDesc": "ติดตั้งพื้นพรีเมียม ตกแต่งผนัง และทาสีด้วยวัสดุคุณภาพสูงสำหรับการตกแต่งที่สมบูรณ์แบบ",
      "lightingDesign": "ออกแบบแสงสว่าง",
      "lightingDesignDesc": "วางแผนและติดตั้งแสงสว่างทางสถาปัตยกรรมเพื่อเพิ่มบรรยากาศ ฟังก์ชัน และความสวยงามของพื้นที่",
      "builtInsFurniture": "บิลท์อินและเฟอร์นิเจอร์",
      "builtInsFurnitureDesc": "งานไม้สั่งทำและเฟอร์นิเจอร์บิลท์อินที่ออกแบบเฉพาะสำหรับพื้นที่และความต้องการจัดเก็บของคุณ",
      "projectManagement": "บริหารโครงการ",
      "projectManagementDesc": "ดูแลทั้งกระบวนการ ควบคุมไทม์ไลน์ และรับประกันคุณภาพเพื่อประสบการณ์การรีโนเวทที่ไร้ความเครียด"
    }
  },
  "footer": {
    "copyright": "© 2024 Regenlanes สงวนลิขสิทธิ์"
  },
  "common": {
    "language": "ภาษา",
    "english": "English",
    "thai": "ไทย"
  }
}
